app/controllers/sessions_controller.rb

  def create
	user = User.find_by(email: params[:session][:email].downcase)  #trovo l'utente attraverso la email che trasmette nel form della session ossia il form di login
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "michael@example.com"], ["LIMIT", 1]]