app/controllers/users_controller.rb

  def create
	@user = User.new(user_params)   #invece di usare (params[:user]) che passava tutti i parametri, non sicuro!
	if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)