app/controllers/users_controller.rb

  def edit
	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 950961012], ["LIMIT", 1]]

  def update
	@user = User.find(params[:id])
	if @user.update_attributes(user_params)   #se l'aggiornamento del profilo va a buon fine...
		flash[:success] = "Profile updated"
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 950961012], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2017-07-07 16:11:19.638101"], ["id", 762146111]]

  def index
	if params[:search]
		@users = User.search(params[:search]).order("created_at DESC").paginate(page: params[:page]).distinct
	else
		@users = User.paginate(page: params[:page])  #variabile che contiene tutti gli utenti del database, utilizzo il metodo paginate per dividerli in più pagine
---
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]

  def destroy
	User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 950961012]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]